Revit 2027 API
STLExportOptions.IsGridAspectRatioSet Method
 Checks whether the GridAspectRatio tessellation parameter is explicitly set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsGridAspectRatioSet()
Public Function IsGridAspectRatioSet As Boolean
public:
bool IsGridAspectRatioSet()
member IsGridAspectRatioSet : unit -> bool
Return Value
Boolean
 True if GridAspectRatio tessellation parameter is explicitly set, false otherwise.
See Also
Reference
STLExportOptions Class
Autodesk.Revit.DB Namespace